Repository: JIHUNJO123/english-proverb-app
Catalog: lib/l10n/app_*.arb
Languages: bn, fa, pl, sv, th, tl, uk, ur, vi

# appTitle
source: English Proverb 300
bn: English Proverbs 300
fa: English Idioms 1000
pl: English Proverbs 300
sv: English Proverbs 300
th: English Proverbs 300
tl: English Proverbs 300
uk: English Proverbs 300
ur: English Proverbs 300
vi: English Idioms 1000

# todayWord
source: 📅 Today's Proverb
bn: 📅 আজকের বাগধারা
fa: 📅 اصطلاح امروز
pl: Przysowie Dnia
sv: 📅 Dagens Ordspråk
th: 📅 สำนวนวันนี้
tl: 📅 Kasabihan Ngayong Araw
uk: 📅 Ідіома дня
ur: ๐ ุขุฌ ฺฉุง ู ุญุงูุฑ
vi: 📅 Thành ngữ hôm nay

source: Learning
bn: শেখা
fa: یادگیری
pl: Nauka
sv: Inlärning
th: เรียน
tl: Pag-aaral
uk: Навчання
ur: ุณฺฉฺพูุง
vi: Học

source: Level Learning
bn: স্তর অনুযায়ী শেখা
fa: یادگیری بر اساس سطح
pl: Nauka wedug Poziomu
sv: Nivåbaserad Inlärning
th: ตามระดับ
tl: Pag-aaral ayon sa Antas
uk: Навчання за рівнями
ur: ุณุทุญ ฺฉ ู ุทุงุจู ุณฺฉฺพูุง
vi: Theo cấp độ

# allWords
source: All Proverbs
bn: সব বাগধারা
fa: همه اصطلاحات
pl: Wszystkie Przysowia
sv: Alla Ordspråk
th: ทั้งหมด
tl: Lahat ng Kasabihan
uk: Усі ідіоми
ur: ุชู ุงู ู ุญุงูุฑ
vi: Tất cả

# viewAllWords
source: View All Proverbs
bn: সব বাগধারা দেখুন
fa: مشاهده همه اصطلاحات
pl: Zobacz wszystkie przysowia
sv: Visa alla ordspråk
th: ดูสำนวนทั้งหมด
tl: Tingnan lahat ng kasabihan
uk: Переглянути всі ідіоми
ur: ุชู ุงู ู ุญุงูุฑ ุฏฺฉฺพฺบ
vi: Xem tất cả thành ngữ

source: Favorites
bn: পছন্দের
fa: علاقه‌مندی‌ها
pl: Ulubione
sv: Favoriter
th: รายการโปรด
tl: Mga Paborito
uk: Обране
ur: ูพุณูุฏุฏ
vi: Yêu thích

# savedWords
source: Saved proverbs
bn: সংরক্ষিত বাগধারা
fa: اصطلاحات ذخیره شده
pl: Zapisane przysowia
sv: Sparade ordspråk
th: สำนวนที่บันทึก
tl: Mga naka-save na kasabihan
uk: Збережені ідіоми
ur: ู ุญููุธ ู ุญุงูุฑ
vi: Thành ngữ đã lưu

source: Flashcard
bn: ফ্ল্যাশকার্ড
fa: فلش کارت
pl: Fiszki
sv: Flashkort
th: แฟลชการ์ด
uk: Картки
ur: ููุด ฺฉุงุฑฺ
vi: Thẻ

# cardLearning
source: Learn with cards
bn: কার্ড দিয়ে শিখুন
fa: یادگیری با کارت
pl: Ucz si z kart
sv: Lär med kort
th: เรียนด้วยการ์ด
tl: Matuto gamit ang card
uk: Вчитися з картками
ur: ฺฉุงุฑฺุฒ ุณ ุณฺฉฺพฺบ
vi: Học bằng thẻ

source: Search
bn: খুঁজুন
fa: جستجو
pl: Szukaj
sv: Sök
th: ค้นหา
tl: Maghanap
uk: Пошук
ur: ุชูุงุด
vi: Tìm kiếm

# searchWords
source: Search proverbs
bn: বাগধারা খুঁজুন
fa: جستجوی اصطلاحات
pl: Szukaj przysów
sv: Sök ordspråk
th: ค้นหาสำนวน
tl: Maghanap ng kasabihan
uk: Шукати ідіоми
ur: ู ุญุงูุฑ ุชูุงุด ฺฉุฑฺบ
vi: Tìm thành ngữ

source: Settings
bn: সেটিংস
fa: تنظیمات
pl: Ustawienia
sv: Inställningar
th: ตั้งค่า
tl: Mga Setting
uk: Налаштування
ur: ุชุฑุชุจุงุช
vi: Cài đặt

# noWords
source: No proverbs found
bn: কোনো বাগধারা পাওয়া যায়নি
fa: اصطلاحی یافت نشد
pl: Nie znaleziono przysów
sv: Inga ordspråk hittades
th: ไม่มีสำนวน
tl: Walang nahanap na kasabihan
uk: Ідіом не знайдено
ur: ฺฉูุฆ ู ุญุงูุฑ ูฺบ ู ู
vi: Không có thành ngữ

# cannotLoadWords
source: Cannot load proverbs
bn: বাগধারা লোড করা যাচ্ছে না
fa: بارگذاری اصطلاحات ممکن نیست
pl: Nie można zaadowa przysów
sv: Kan inte ladda ordspråk
th: ไม่สามารถโหลดได้
tl: Hindi mai-load ang mga kasabihan
uk: Не вдалося завантажити ідіоми
ur: ู ุญุงูุฑ ููฺ ูฺบ ู ุณฺฉ
vi: Không thể tải thành ngữ

source: Added to favorites
bn: পছন্দে যোগ করা হয়েছে
fa: به علاقه‌مندی‌ها اضافه شد
pl: Dodano do ulubionych
sv: Tillagd i favoriter
th: เพิ่มในรายการโปรด
tl: Idinagdag sa mga paborito
uk: Додано до обраного
ur: ูพุณูุฏุฏ ู ฺบ ุดุงู ู
vi: Đã thêm vào yêu thích

source: Removed from favorites
bn: পছন্দ থেকে সরানো হয়েছে
fa: از علاقه‌مندی‌ها حذف شد
pl: Usunito z ulubionych
sv: Borttagen från favoriter
th: ลบออกจากรายการโปรด
tl: Tinanggal sa mga paborito
uk: Видалено з обраного
ur: ูพุณูุฏุฏ ุณ ูนุง ุฏุง ฺฏุง
vi: Đã xóa khỏi yêu thích

source: 📖 Definition
bn: 📖 সংজ্ঞা
fa: 📖 تعریف
pl: Definicja
th: 📖 ความหมาย
tl: 📖 Kahulugan
uk: 📖 Визначення
ur: ๐ ุชุนุฑู
vi: 📖 Nghĩa

source: 💬 Example
bn: 💬 উদাহরণ
fa: 💬 مثال
pl: Przykad
sv: 💬 Exempel
th: 💬 ตัวอย่าง
tl: 💬 Halimbawa
uk: 💬 Приклад
ur: ๐ฌ ู ุซุงู
vi: 💬 Ví dụ

source: Translating...
bn: অনুবাদ হচ্ছে...
fa: در حال ترجمه...
pl: Tumaczenie...
sv: Översätter...
th: กำลังแปล...
tl: Nagsasalin...
uk: Перекладаємо...
ur: ุชุฑุฌู  ู ุฑุง ...
vi: Đang dịch...

source: Listen Pronunciation
bn: উচ্চারণ শুনুন
fa: گوش دادن به تلفظ
pl: Posuchaj Wymowy
sv: Lyssna på uttal
th: ฟัง
tl: Pakinggan ang Pagbigkas
uk: Прослухати вимову
ur: ุชููุธ ุณูฺบ
vi: Nghe

source: Mark as Learned
bn: শেখা হিসেবে চিহ্নিত করুন
fa: علامت‌گذاری به عنوان یاد گرفته شده
pl: Oznacz jako Nauczone
sv: Markera som inlärd
th: ทำเครื่องหมายเรียนแล้ว
tl: Markahan bilang Natutunan
uk: Позначити як вивчене
ur: ุณฺฉฺพุง ูุง ูุดุงู ูฺฏุงุฆฺบ
vi: Đánh dấu đã học

source: Previous
bn: আগের
fa: قبلی
pl: Poprzedni
sv: Föregående
th: ก่อนหน้า
tl: Nakaraan
uk: Попереднє
ur: ูพฺฺพูุง
vi: Trước

source: Next
bn: পরের
fa: بعدی
pl: Nastpny
sv: Nästa
th: ถัดไป
tl: Susunod
uk: Наступне
ur: ุงฺฏูุง
vi: Tiếp

# pronunciation
source: Pronounce
bn: উচ্চারণ
fa: تلفظ
pl: Wymowa
sv: Uttal
th: ออกเสียง
tl: Pagbigkas
uk: Вимова
ur: ุชููุธ
vi: Phát âm

source: Tap to flip
bn: উল্টাতে ট্যাপ করুন
fa: برای برگرداندن ضربه بزنید
pl: Dotknij, aby odwróci
sv: Tryck för att vända
th: แตะเพื่อพลิก
tl: I-tap para i-flip
uk: Натисніть, щоб перевернути
ur: ูพููนู ฺฉ ู ูนูพ ฺฉุฑฺบ
vi: Chạm để lật

# levelA1
source: Beginner 1
bn: প্রাথমিক ১
fa: مبتدی ۱
pl: Pocztkujcy 1
sv: Nybörjare 1
th: เริ่มต้น 1
tl: Baguhan 1
uk: Початківець 1
ur: ุงุจุชุฏุงุฆ ฑ
vi: Sơ cấp 1

# levelA2
source: Beginner 2
bn: প্রাথমিক ২
fa: مبتدی ۲
pl: Pocztkujcy 2
sv: Nybörjare 2
th: เริ่มต้น 2
tl: Baguhan 2
uk: Початківець 2
ur: ุงุจุชุฏุงุฆ ฒ
vi: Sơ cấp 2

# levelB1
source: Intermediate 1
bn: মধ্যবর্তী ১
fa: متوسط ۱
pl: redniozaawansowany 1
sv: Medel 1
th: กลาง 1
tl: Katamtaman 1
uk: Середній 1
ur: ุฏุฑู ุงู ฑ
vi: Trung cấp 1

# levelB2
source: Intermediate 2
bn: মধ্যবর্তী ২
fa: متوسط ۲
pl: redniozaawansowany 2
sv: Medel 2
th: กลาง 2
tl: Katamtaman 2
uk: Середній 2
ur: ุฏุฑู ุงู ฒ
vi: Trung cấp 2

# levelC1
source: Advanced
bn: উন্নত
fa: پیشرفته
pl: Zaawansowany
sv: Avancerad
th: ขั้นสูง
uk: Просунутий
ur: ุงฺูุงูุณ
vi: Cao cấp

# levelWords
source: {level} Proverbs
bn: {level} বাগধারা
fa: اصطلاحات {level}
pl: Przysowia {level}
sv: {level} Ordspråk
th: สำนวน {level}
tl: {level} na Kasabihan
uk: Ідіоми {level}
ur: {level} ู ุญุงูุฑ
vi: Thành ngữ {level}

source: Flashcard Mode
bn: ফ্ল্যাশকার্ড মোড
fa: حالت فلش کارت
pl: Tryb Fiszek
sv: Flashkortsläge
th: โหมดการ์ด
uk: Режим карток
ur: ููุด ฺฉุงุฑฺ ู ูฺ
vi: Chế độ thẻ

source: List Mode
bn: তালিকা মোড
fa: حالت لیست
pl: Tryb Listy
sv: Listläge
th: โหมดรายการ
uk: Режим списку
ur: ูุฑุณุช ู ูฺ
vi: Chế độ danh sách

source: Language
bn: ভাষা
fa: زبان
pl: Jzyk
sv: Språk
th: ภาษา
tl: Wika
uk: Мова
ur: ุฒุจุงู
vi: Ngôn ngữ

# selectLanguage
source: Select Your Language
bn: আপনার ভাষা নির্বাচন করুন
fa: زبان خود را انتخاب کنید
pl: Wybierz swój jzyk
sv: Välj ditt språk
th: เลือกภาษา
tl: Piliin ang Iyong Wika
uk: Виберіть мову
ur: ุงูพู ุฒุจุงู ู ูุชุฎุจ ฺฉุฑฺบ
vi: Chọn ngôn ngữ

# languageChanged
source: Language changed to {language}
bn: ভাষা {language} এ পরিবর্তিত হয়েছে
fa: زبان به {language} تغییر یافت
pl: Jzyk zmieniony na {language}
sv: Språk ändrat till {language}
th: เปลี่ยนเป็น {language}
tl: Pinalitan ang wika sa {language}
uk: Мову змінено на {language}
ur: ุฒุจุงู {language} ู ฺบ ุชุจุฏู ู ฺฏุฆ
vi: Đã đổi sang {language}

source: Translation Info
bn: অনুবাদ তথ্য
fa: اطلاعات ترجمه
pl: Informacje o Tumaczeniu
sv: Översättningsinformation
th: ข้อมูลการแปล
tl: Impormasyon sa Pagsasalin
uk: Інформація про переклад
ur: ุชุฑุฌู  ฺฉ ู ุนููู ุงุช
vi: Thông tin dịch

# translationInfoDesc
source: Translations will be downloaded automatically when you view Proverbs. Once downloaded, they are cached locally for offline use.
bn: শব্দ দেখার সময় অনুবাদ স্বয়ংক্রিয়ভাবে ডাউনলোড হবে। ডাউনলোডের পরে অফলাইন ব্যবহারের জন্য স্থানীয়ভাবে সংরক্ষিত থাকবে।
fa: ترجمه‌ها هنگام مشاهده کلمات به صورت خودکار دانلود می‌شوند. پس از دانلود، برای استفاده آفلاین به صورت محلی ذخیره می‌شوند.
pl: Tumaczenia zostan automatycznie pobrane podczas przegldania sów. Po pobraniu s przechowywane lokalnie do użytku offline.
sv: Översättningar laddas ner automatiskt när du visar ord. Efter nedladdning sparas de lokalt för offlineanvändning.
th: คำแปลจะดาวน์โหลดอัตโนมัติ เมื่อดาวน์โหลดแล้วจะใช้งานออฟไลน์ได้
tl: Awtomatikong ida-download ang mga pagsasalin kapag tiningnan mo ang mga salita. Pagkatapos i-download, ito ay naka-cache nang lokal para sa offline na paggamit.
uk: Переклади завантажуються автоматично під час перегляду слів. Після завантаження вони зберігаються локально для офлайн-використання.
ur: ุงููุงุธ ุฏฺฉฺพุช ููุช ุชุฑุฌู  ุฎูุฏ ุจุฎูุฏ ฺุงุคู ููฺ ูฺบ ฺฏ ุขู ูุงุฆู ุงุณุชุนู ุงู ฺฉ ู ู ูุงู  ุทูุฑ ูพุฑ ู ุญููุธ ูฺบ ฺฏ
vi: Bản dịch sẽ được tải xuống tự động. Sau khi tải, có thể sử dụng ngoại tuyến.

source: OK
bn: ঠিক আছে
fa: باشه
th: ตกลง
ur: ูนฺพฺฉ 

source: Dark Mode
bn: ডার্ক মোড
fa: حالت تاریک
pl: Tryb Ciemny
sv: Mörkt läge
th: โหมดมืด
uk: Темний режим
ur: ฺุงุฑฺฉ ู ูฺ
vi: Chế độ tối

source: Speech Rate
bn: কথার গতি
fa: سرعت گفتار
pl: Szybko Mowy
sv: Talhastighet
th: ความเร็ว
tl: Bilis ng Pagsasalita
uk: Швидкість мовлення
ur: ุจููู ฺฉ ุฑูุชุงุฑ
vi: Tốc độ

source: Notifications
bn: বিজ্ঞপ্তি
fa: اعلان‌ها
pl: Powiadomienia
sv: Aviseringar
th: การแจ้งเตือน
tl: Mga Notification
uk: Сповіщення
ur: ุงุทูุงุนุงุช
vi: Thông báo

source: Daily Reminder
bn: দৈনিক রিমাইন্ডার
fa: یادآوری روزانه
pl: Codzienne Przypomnienie
sv: Daglig påminnelse
th: เตือนทุกวัน
tl: Pang-araw-araw na Paalala
uk: Щоденне нагадування
ur: ุฑูุฒุงู ุงุฏ ุฏุงู
vi: Nhắc nhở hàng ngày

source: About
bn: সম্পর্কে
fa: درباره
pl: O aplikacji
sv: Om
th: เกี่ยวกับ
tl: Tungkol
uk: Про додаток
ur: ฺฉ ุจุงุฑ ู ฺบ
vi: Về

source: Version
bn: সংস্করণ
fa: نسخه
pl: Wersja
th: เวอร์ชัน
tl: Bersyon
uk: Версія
ur: ูุฑฺู
vi: Phiên bản

source: Developer
bn: ডেভেলপার
fa: توسعه‌دهنده
pl: Deweloper
sv: Utvecklare
th: ผู้พัฒนา
uk: Розробник
ur: ฺูููพุฑ
vi: Nhà phát triển

# searchHint
source: Search for Proverbs...
bn: বাগধারা খুঁজুন...
fa: جستجوی اصطلاحات...
pl: Szukaj przysów...
sv: Sök efter ord...
th: ค้นหาสำนวน...
tl: Maghanap ng mga salita...
uk: Шукати ідіоми...
ur: ู ุญุงูุฑ ุชูุงุด ฺฉุฑฺบ...
vi: Tìm thành ngữ...

# noSearchResults
source: No results found
bn: কোনো ফলাফল পাওয়া যায়নি
fa: نتیجه‌ای یافت نشد
pl: Nie znaleziono wyników
sv: Inga resultat hittades
th: ไม่พบผลลัพธ์
tl: Walang nahanap na resulta
uk: Результатів не знайдено
ur: ฺฉูุฆ ูุชุงุฆุฌ ูฺบ ู ู
vi: Không có kết quả

# typeToSearch
source: Type to Search for Proverbs...
bn: শব্দ খুঁজতে টাইপ করুন
fa: برای جستجوی اصطلاحات تایپ کنید
pl: Wpisz, aby wyszuka sowa
sv: Skriv för att söka efter ord
th: พิมพ์เพื่อค้นหา
tl: Mag-type para maghanap ng mga salita
uk: Введіть для пошуку слів
ur: ุงููุงุธ ุชูุงุด ฺฉุฑู ฺฉ ู ูนุงุฆูพ ฺฉุฑฺบ
vi: Nhập để tìm kiếm

# noFavorites
source: No favorites yet
bn: এখনো কোনো পছন্দ নেই
fa: هنوز علاقه‌مندی‌ای نیست
pl: Brak ulubionych
sv: Inga favoriter ännu
th: ยังไม่มีรายการโปรด
tl: Wala pang mga paborito
uk: Поки що немає обраного
ur: ุงุจฺพ ฺฉูุฆ ูพุณูุฏุฏ ูฺบ
vi: Chưa có yêu thích

# addFavoritesHint
source: Add Proverbs to favorites by tapping the heart icon
bn: হার্ট আইকনে ট্যাপ করে শব্দ পছন্দে যোগ করুন
fa: با ضربه زدن روی آیکون قلب، کلمات را به علاقه‌مندی‌ها اضافه کنید
pl: Dodaj sowa do ulubionych, dotykajc ikony serca
sv: Lägg till ord i favoriter genom att trycka på hjärtikonen
th: แตะหัวใจเพื่อเพิ่ม
tl: Magdagdag ng mga salita sa mga paborito sa pamamagitan ng pag-tap sa icon ng puso
uk: Додайте слова до обраного, натиснувши на іконку серця
ur: ุฏู ฺฉ ุขุฆฺฉู ูพุฑ ูนูพ ฺฉุฑฺฉ ุงููุงุธ ูพุณูุฏุฏ ู ฺบ ุดุงู ู ฺฉุฑฺบ
vi: Nhấn vào trái tim để thêm

# posNoun
source: noun
bn: বিশেষ্য
fa: اسم
pl: rzeczownik
sv: substantiv
th: คำนาม
tl: pangngalan
uk: іменник
ur: ุงุณู
vi: danh từ

# posVerb
source: verb
bn: ক্রিয়া
fa: فعل
pl: czasownik
th: กริยา
tl: pandiwa
uk: дієслово
ur: ูุนู
vi: động từ

# posAdjective
source: adjective
bn: বিশেষণ
fa: صفت
pl: przymiotnik
sv: adjektiv
th: คำคุณศัพท์
tl: pang-uri
uk: прикметник
ur: ุตูุช
vi: tính từ

# posAdverb
source: adverb
bn: ক্রিয়া বিশেষণ
fa: قید
pl: przysówek
th: กริยาวิเศษณ์
tl: pang-abay
uk: прислівник
ur: ู ุชุนูู ูุนู
vi: trạng từ

# posPronoun
source: pronoun
bn: সর্বনাম
fa: ضمیر
pl: zaimek
sv: pronomen
th: สรรพนาม
tl: panghalip
uk: займенник
ur: ุถู ุฑ
vi: đại từ

# posPreposition
source: preposition
bn: অব্যয়
fa: حرف اضافه
pl: przyimek
th: คำบุพบท
tl: pang-ukol
uk: прийменник
ur: ุญุฑู ุฌุงุฑ
vi: giới từ

# posConjunction
source: conjunction
bn: সংযোজক
fa: حرف ربط
pl: spójnik
sv: konjunktion
th: คำเชื่อม
tl: pangatnig
uk: сполучник
ur: ุญุฑู ุนุทู
vi: liên từ

# posInterjection
source: interjection
bn: আবেগসূচক
fa: حرف ندا
pl: wykrzyknik
sv: interjektion
th: คำอุทาน
tl: pandamdam
uk: вигук
ur: ุญุฑู ูุฏุง
vi: thán từ

# posArticle
source: article
bn: প্রবন্ধ
fa: حرف تعریف
pl: rodzajnik
sv: artikel
th: คำนำหน้านาม
tl: pantukoy
uk: артикль
ur: ุญุฑู ุชุนุฑู
vi: mạo từ

# posDeterminer
source: determiner
bn: নির্ধারক
fa: تعیین‌کننده
pl: okrelnik
sv: determinativ
th: คำกำหนด
tl: pananda
uk: детермінатив
ur: ู ุนู
vi: từ hạn định

# posAuxiliary
source: auxiliary verb
bn: সহায়ক ক্রিয়া
fa: فعل کمکی
pl: czasownik posikowy
sv: hjälpverb
th: กริยาช่วย
tl: pantulong na pandiwa
uk: допоміжне дієслово
ur: ูุนู ู ุนุงูู
vi: trợ động từ

# posPhrasal
source: phrasal verb
bn: বাক্যাংশ ক্রিয়া
fa: فعل عبارتی
pl: czasownik frazowy
sv: frasverb
th: กริยาวลี
tl: pariralang pandiwa
uk: фразове дієслово
ur: ู ุญุงูุฑุงุช ูุนู
vi: cụm động từ

source: Show translation first
bn: আগে অনুবাদ দেখান
fa: ابتدا ترجمه نشان داده شود
pl: Pokaż najpierw tumaczenie
sv: Visa översättning först
th: แสดงคำแปลก่อน
tl: Ipakita muna ang pagsasalin
uk: Спочатку показати переклад
ur: ูพู ุชุฑุฌู  ุฏฺฉฺพุงุฆฺบ
vi: Hiển thị bản dịch trước

# showTranslationFirstDesc
source: Display translated meaning before English
bn: ইংরেজির আগে অনুবাদিত অর্থ দেখান
fa: معنی ترجمه شده را قبل از انگلیسی نمایش دهید
pl: Wywietl przetumaczone znaczenie przed angielskim
sv: Visa översatt betydelse före engelska
th: แสดงความหมายที่แปลแล้วก่อนภาษาอังกฤษ
tl: Ipakita ang isinalin na kahulugan bago ang English
uk: Показувати перекладене значення перед англійським
ur: ุงูฺฏุฑุฒ ุณ ูพู ุชุฑุฌู  ุดุฏ ู ุนู ุฏฺฉฺพุงุฆฺบ
vi: Hiển thị nghĩa đã dịch trước tiếng Anh

source: Display
bn: প্রদর্শন
fa: نمایش
pl: Wywietlanie
sv: Visning
th: การแสดงผล
uk: Відображення
ur: ฺุณูพู
vi: Hiển thị

source: Use dark theme
bn: ডার্ক থিম ব্যবহার করুন
fa: استفاده از تم تاریک
pl: Użyj ciemnego motywu
sv: Använd mörkt tema
th: ใช้ธีมมืด
tl: Gumamit ng dark theme
uk: Використовувати темну тему
ur: ฺุงุฑฺฉ ุชฺพู ุงุณุชุนู ุงู ฺฉุฑฺบ
vi: Sử dụng giao diện tối

# restartToApply
source: Restart app to apply theme change
bn: থিম পরিবর্তন প্রয়োগ করতে অ্যাপ রিস্টার্ট করুন
fa: برای اعمال تغییر تم، برنامه را مجدداً راه‌اندازی کنید
pl: Uruchom ponownie aplikacj, aby zastosowa zmian motywu
sv: Starta om appen för att tillämpa temaändring
th: รีสตาร์ทแอปเพื่อใช้การเปลี่ยนธีม
tl: I-restart ang app para ilapat ang pagbabago ng tema
uk: Перезапустіть додаток для застосування зміни теми
ur: ุชฺพู ุชุจุฏู ูุงฺฏู ฺฉุฑู ฺฉ ู ุงูพ ุฏูุจุงุฑ ุดุฑูุน ฺฉุฑฺบ
vi: Khởi động lại ứng dụng để áp dụng thay đổi giao diện

# learningSection
source: Learning
bn: শেখা
fa: یادگیری
pl: Nauka
sv: Inlärning
th: การเรียนรู้
tl: Pag-aaral
uk: Навчання
ur: ุณฺฉฺพูุง
vi: Học tập

# currentSpeed
source: Current: {speed}x
bn: বর্তমান: {speed}x
fa: فعلی: {speed}x
pl: Aktualna: {speed}x
sv: Nuvarande: {speed}x
th: ปัจจุบัน: {speed}เท่า
tl: Kasalukuyan: {speed}x
uk: Поточна: {speed}x
ur: ู ูุฌูุฏ: {speed}x
vi: Hiện tại: {speed}x

# getDailyReminders
source: Get daily learning reminders
bn: দৈনিক শেখার রিমাইন্ডার পান
fa: دریافت یادآوری‌های روزانه یادگیری
pl: Otrzymuj codzienne przypomnienia o nauce
sv: Få dagliga inlärningspåminnelser
th: รับการเตือนเรียนรู้ประจำวัน
tl: Makatanggap ng pang-araw-araw na paalala sa pag-aaral
uk: Отримувати щоденні нагадування про навчання
ur: ุฑูุฒุงู ุณฺฉฺพู ฺฉ ุงุฏ ุฏุงูุงฺบ ุญุงุตู ฺฉุฑฺบ
vi: Nhận nhắc nhở học tập hàng ngày

source: Copyright
bn: কপিরাইট
fa: حق نشر
pl: Prawa autorskie
sv: Upphovsrätt
th: ลิขสิทธิ์
uk: Авторське право
ur: ฺฉุงูพ ุฑุงุฆูน
vi: Bản quyền

# copyrightDesc
source: All definitions are original or AI-generated
bn: সব সংজ্ঞা মূল বা AI-জেনারেটেড
fa: تمام تعاریف اصلی یا تولید شده توسط هوش مصنوعی هستند
pl: Wszystkie definicje s oryginalne lub wygenerowane przez AI
sv: Alla definitioner är originella eller AI-genererade
th: คำนิยามทั้งหมดเป็นต้นฉบับหรือสร้างโดย AI
tl: Lahat ng kahulugan ay orihinal o AI-generated
uk: Усі визначення оригінальні або згенеровані ШІ
ur: ุชู ุงู ุชุนุฑูฺบ ุงุตู ุง AI ุณ ุชุงุฑ ฺฉุฑุฏ ฺบ
vi: Tất cả định nghĩa là gốc hoặc do AI tạo

source: Copyright Notice
bn: কপিরাইট বিজ্ঞপ্তি
fa: اعلامیه حق نشر
pl: Informacja o Prawach Autorskich
sv: Upphovsrättsmeddelande
th: ประกาศลิขสิทธิ์
tl: Abiso sa Copyright
uk: Повідомлення про авторське право
ur: ฺฉุงูพ ุฑุงุฆูน ูููนุณ
vi: Thông báo bản quyền

# copyrightContent
source: All Proverb definitions and example sentences in this app are original or AI-generated. No copyrighted dictionary content is used.
bn: এই অ্যাপের সমস্ত শব্দ সংজ্ঞা এবং উদাহরণ বাক্য মূল বা AI-জেনারেটেড।
fa: تمام تعاریف کلمات و جملات مثال در این برنامه اصلی یا تولید شده توسط هوش مصنوعی هستند.
pl: Wszystkie definicje sów i przykadowe zdania w tej aplikacji s oryginalne lub wygenerowane przez AI. Nie wykorzystano treci sownikowych chronionych prawami autorskimi.
sv: Alla orddefinitioner och exempelmeningar i denna app är originella eller AI-genererade.
th: คำนิยามคำศัพท์และตัวอย่างประโยคทั้งหมดในแอปนี้เป็นต้นฉบับหรือสร้างโดย AI ไม่มีการใช้เนื้อหาพจนานุกรมที่มีลิขสิทธิ์
tl: Lahat ng kahulugan ng salita at halimbawang pangungusap sa app na ito ay orihinal o AI-generated.
uk: Усі визначення слів та приклади речень у цьому додатку є оригінальними або згенерованими ШІ.
ur: ุงุณ ุงูพ ู ฺบ ุชู ุงู ู ุญุงูุฑ ฺฉ ุชุนุฑูฺบ ุงูุฑ ู ุซุงู ุฌู ู ุงุตู ุง AI ุณ ุชุงุฑ ฺฉุฑุฏ ฺบ
vi: Tất cả định nghĩa từ và câu ví dụ trong ứng dụng này là gốc hoặc do AI tạo ra. Không sử dụng nội dung từ điển có bản quyền. Bản dịch được cung cấp bởi MyMemory API (dịch vụ dịch miễn phí).

source: Privacy Policy
bn: গোপনীয়তা নীতি
fa: سیاست حفظ حریم خصوصی
pl: Polityka Prywatnoci
sv: Integritetspolicy
th: นโยบายความเป็นส่วนตัว
tl: Patakaran sa Privacy
uk: Політика конфіденційності
ur: ุฑุงุฒุฏุงุฑ ฺฉ ูพุงูุณ
vi: Chính sách quyền riêng tư

# privacyContent
source: This app does not collect, store, or share any personal information.
bn: এই অ্যাপ কোনো ব্যক্তিগত তথ্য সংগ্রহ, সংরক্ষণ বা শেয়ার করে না।
fa: این برنامه هیچ اطلاعات شخصی جمع‌آوری، ذخیره یا به اشتراک نمی‌گذارد.
pl: Ta aplikacja nie zbiera, nie przechowuje ani nie udostpnia żadnych danych osobowych.
sv: Denna app samlar inte in, lagrar eller delar någon personlig information.
th: แอปนี้ไม่เก็บรวบรวม จัดเก็บ หรือแชร์ข้อมูลส่วนบุคคลใดๆ
tl: Hindi kumukuha, nag-iimbak, o nagbabahagi ang app na ito ng anumang personal na impormasyon.
uk: Цей додаток не збирає, не зберігає та не передає жодної персональної інформації.
ur:  ุงูพ ฺฉูุฆ ุฐุงุช ู ุนููู ุงุช ุฌู ุนุ ุฐุฎุฑ ุง ุดุฆุฑ ูฺบ ฺฉุฑุช
vi: Ứng dụng này không thu thập, lưu trữ hoặc chia sẻ bất kỳ thông tin cá nhân nào. Các yêu cầu dịch được gửi đến MyMemory API để xử lý. Dữ liệu người dùng không được lưu trữ trên máy chủ bên ngoài.

source: Alphabetical
bn: বর্ণানুক্রমিক
fa: الفبایی
pl: Alfabetycznie
sv: Alfabetisk
th: ตามตัวอักษร
tl: Alpabetiko
uk: За алфавітом
ur: ุญุฑูู ุชุฌ
vi: Theo bảng chữ cái

source: Random
bn: এলোমেলো
fa: تصادفی
pl: Losowo
sv: Slumpmässig
th: สุ่ม
uk: Випадково
ur: ุจ ุชุฑุชุจ
vi: Ngẫu nhiên

source: Quiz
bn: কুইজ
fa: آزمون
th: แบบทดสอบ
uk: Тест
ur: ฺฉูุฆุฒ
vi: Kiểm tra

source: Test yourself
bn: নিজেকে পরীক্ষা করুন
fa: خودتان را بیازمایید
pl: Sprawdź si
sv: Testa dig själv
th: ทดสอบตัวเอง
tl: Subukan ang iyong sarili
uk: Перевірте себе
ur: ุฎูุฏ ฺฉู ุขุฒู ุงุฆฺบ
vi: Tự kiểm tra

# wordQuiz
source: Proverb Quiz
bn: বাগধারা কুইজ
fa: آزمون اصطلاحات
pl: Quiz przysów
sv: Ordspråksquiz
th: แบบทดสอบสำนวน
tl: Quiz sa Kasabihan
uk: Тест ідіом
ur: ู ุญุงูุฑ ฺฉูุฆุฒ
vi: Kiểm tra thành ngữ

# quizWithLevel
source: {level} Quiz
bn: {level} কুইজ
fa: آزمون {level}
pl: Quiz {level}
th: แบบทดสอบ {level}
uk: Тест {level}
ur: {level} ฺฉูุฆุฒ
vi: Kiểm tra {level}

# wordToMeaningMode
source: Proverb→Meaning
bn: বাগধারা→অর্থ
fa: اصطلاح←معنی
pl: PrzysowieZnaczenie
sv: Ordspråk→Betydelse
th: สำนวน→ความหมาย
tl: Kasabihan→Kahulugan
uk: Ідіома→Значення
ur: ู ุญุงูุฑโู ุนู
vi: Thành ngữ→Nghĩa

# meaningToWordMode
source: Meaning→Proverb
bn: অর্থ→বাগধারা
fa: معنی←اصطلاح
pl: ZnaczeniePrzysowie
sv: Betydelse→Ordspråk
th: ความหมาย→สำนวน
tl: Kahulugan→Kasabihan
uk: Значення→Ідіома
ur: ู ุนูโู ุญุงูุฑ
vi: Nghĩa→Thành ngữ

source: 🎉 Quiz Complete!
bn: 🎉 কুইজ সম্পূর্ণ!
fa: 🎉 آزمون کامل شد!
pl: Quiz ukoczony!
sv: 🎉 Quiz klar!
th: 🎉 ทำแบบทดสอบเสร็จแล้ว!
tl: 🎉 Tapos na ang Quiz!
uk: 🎉 Тест завершено!
ur: ๐ ฺฉูุฆุฒ ู ฺฉู ู!
vi: 🎉 Hoàn thành kiểm tra!

# correctAnswers
source: {percentage}% Correct
bn: {percentage}% সঠিক
fa: {percentage}% صحیح
pl: {percentage}% Poprawnie
sv: {percentage}% rätt
th: {percentage}% ถูกต้อง
tl: {percentage}% Tama
uk: {percentage}% правильно
ur: {percentage}% ุฏุฑุณุช
vi: {percentage}% Đúng

source: Exit
bn: বের হন
fa: خروج
pl: Wyjdź
sv: Avsluta
th: ออก
tl: Lumabas
uk: Вийти
ur: ุจุงุฑ ูฺฉูฺบ
vi: Thoát

source: Try Again
bn: আবার চেষ্টা করুন
fa: دوباره امتحان کنید
pl: Spróbuj ponownie
sv: Försök igen
th: ลองใหม่
tl: Subukan Muli
uk: Спробувати ще
ur: ุฏูุจุงุฑ ฺฉูุดุด ฺฉุฑฺบ
vi: Thử lại

# quizCompleteMessage
source: Quiz Complete!
bn: কুইজ সম্পূর্ণ!
fa: آزمون کامل شد!
pl: Quiz ukoczony!
sv: Quiz klar!
th: ทำแบบทดสอบเสร็จแล้ว!
tl: Tapos na ang Quiz!
uk: Тест завершено!
ur: ฺฉูุฆุฒ ู ฺฉู ู!
vi: Hoàn thành kiểm tra!

source: Excellent! 🌟
bn: চমৎকার! 🌟
fa: عالی! 🌟
pl: Doskonale!
sv: Utmärkt! 🌟
th: ยอดเยี่ยม! 🌟
tl: Napakahusay! 🌟
uk: Відмінно! 🌟
ur: ุจุชุฑู! ๐
vi: Xuất sắc! 🌟

source: Great Job! 👏
bn: দারুণ! 👏
fa: آفرین! 👏
pl: wietna robota!
sv: Bra jobbat! 👏
th: เก่งมาก! 👏
tl: Magaling! 👏
uk: Чудово! 👏
ur: ุดุงุจุงุด! ๐
vi: Làm tốt lắm! 👏

source: Good Start! 💪
bn: ভালো শুরু! 💪
fa: شروع خوب! 💪
pl: Dobry pocztek!
sv: Bra start! 💪
th: เริ่มต้นดี! 💪
tl: Magandang Simula! 💪
uk: Гарний початок! 💪
ur: ุงฺฺพ ุดุฑูุนุงุช! ๐ช
vi: Khởi đầu tốt! 💪

source: Keep Practicing! 📚
bn: অনুশীলন চালিয়ে যান! 📚
fa: به تمرین ادامه دهید! 📚
pl: wicz dalej!
sv: Fortsätt öva! 📚
th: ฝึกต่อไป! 📚
tl: Magpatuloy sa Pagsasanay! 📚
uk: Продовжуйте практикуватися! 📚
ur: ู ุดู ุฌุงุฑ ุฑฺฉฺพฺบ! ๐
vi: Tiếp tục luyện tập! 📚

# whatIsTheMeaning
source: What is the meaning of this Proverb?
bn: এই বাগধারার অর্থ কী?
fa: معنی این اصطلاح چیست؟
pl: Jakie jest znaczenie tego sowa?
sv: Vad betyder detta ordspråk?
th: สำนวนนี้มีความหมายว่าอะไร?
tl: Ano ang kahulugan ng kasabihan na ito?
uk: Що означає ця ідіома?
ur: ุงุณ ู ุญุงูุฑ ฺฉุง ู ุทูุจ ฺฉุง ุ
vi: Nghĩa của thành ngữ này là gì?

# whichWordMatches
source: Which Proverb matches this meaning?
bn: কোন বাগধারাটি এই অর্থের সাথে মেলে?
fa: کدام اصطلاح با این معنی مطابقت دارد؟
pl: Które przysowie pasuje do tego znaczenia?
sv: Vilket ordspråk matchar denna betydelse?
th: สำนวนไหนตรงกับความหมายนี้?
tl: Aling kasabihan ang tumutugma sa kahulugang ito?
uk: Яка ідіома відповідає цьому значенню?
ur: ฺฉูู ุณุง ู ุญุงูุฑ ุงุณ ู ุนู ุณ ู ูุชุง ุ
vi: Thành ngữ nào phù hợp với nghĩa này?
