Repository: JIHUNJO123/english-proverb-app
Catalog: lib/l10n/app_*.arb
Languages: bn, fa, pl, sv, th, tl, uk, ur, vi

# nextQuestion
source: Next
bn: পরবর্তী
fa: بعدی
pl: Dalej
sv: Nästa
th: ถัดไป
tl: Susunod
uk: Далі
ur: ุงฺฏูุง
vi: Tiếp theo

source: Loading...
bn: লোড হচ্ছে...
fa: در حال بارگذاری...
pl: adowanie...
sv: Laddar...
th: กำลงโหลด...
tl: Naglo-load...
uk: Завантаження...
ur: ููฺ ู ุฑุง ...
vi: Đang tải...

source: Remove Ads
bn: বিজ্ঞাপন সরান
fa: حذف تبلیغات
pl: Usu reklamy
sv: Ta bort annonser
th: ลบโฆษณา
tl: Alisin ang Ads
uk: Видалити рекламу
ur: ุงุดุชุงุฑุงุช ูนุงุฆฺบ
vi: Xóa quảng cáo

# removeAdsTitle
source: Remove All Ads
bn: সব বিজ্ঞাপন সরান
fa: حذف همه تبلیغات
pl: Usu wszystkie reklamy
sv: Ta bort alla annonser
th: ลบโฆษณาทั้งหมด
tl: Alisin ang Lahat ng Ads
uk: Видалити всю рекламу
ur: ุชู ุงู ุงุดุชุงุฑุงุช ูนุงุฆฺบ
vi: Xóa tất cả quảng cáo

# removeAdsDesc
source: Enjoy ad-free learning experience
bn: বিজ্ঞাপন-মুক্ত শেখার অভিজ্ঞতা উপভোগ করুন
fa: از تجربه یادگیری بدون تبلیغات لذت ببرید
pl: Ciesz si nauk bez reklam
sv: Njut av en annonsfri inlärningsupplevelse
th: เพลิดเพลินกับการเรียนรู้โดยไม่มีโฆษณา
tl: Mag-enjoy ng karanasan sa pag-aaral na walang ads
uk: Насолоджуйтесь навчанням без реклами
ur: ุงุดุชุงุฑุงุช ฺฉ ุจุบุฑ ุณฺฉฺพู ฺฉุง ูุทู ุงูนฺพุงุฆฺบ
vi: Tận hưởng trải nghiệm học không quảng cáo

source: Ads Removed
bn: বিজ্ঞাপন সরানো হয়েছে
fa: تبلیغات حذف شد
pl: Reklamy usunite
sv: Annonser borttagna
th: ลบโฆษณาแล้ว
tl: Naalis na ang Ads
uk: Рекламу видалено
ur: ุงุดุชุงุฑุงุช ูนุง ุฏ ฺฏุฆ
vi: Đã xóa quảng cáo

# enjoyAdFree
source: Enjoy your ad-free experience!
bn: আপনার বিজ্ঞাপন-মুক্ত অভিজ্ঞতা উপভোগ করুন!
fa: از تجربه بدون تبلیغات خود لذت ببرید!
pl: Ciesz si dowiadczeniem bez reklam!
sv: Njut av din annonsfria upplevelse!
th: เพลิดเพลินกับประสบการณ์ไร้โฆษณา!
tl: Mag-enjoy sa iyong karanasang walang ads!
uk: Насолоджуйтесь без реклами!
ur: ุงุดุชุงุฑุงุช ฺฉ ุจุบุฑ ุชุฌุฑุจ ฺฉุง ูุทู ุงูนฺพุงุฆฺบ!
vi: Tận hưởng trải nghiệm không quảng cáo!

source: Restore Purchase
bn: কেনাকাটা পুনরুদ্ধার করুন
fa: بازیابی خرید
pl: Przywró zakup
sv: Återställ köp
th: กู้คืนการซื้อ
tl: Ibalik ang Pagbili
uk: Відновити покупку
ur: ุฎุฑุฏุงุฑ ุจุญุงู ฺฉุฑฺบ
vi: Khôi phục giao dịch

# restorePurchaseDesc
source: Reinstalled or switched devices? Tap here to restore your ad-free purchase.
bn: অ্যাপ পুনরায় ইনস্টল করেছেন বা ডিভাইস পরিবর্তন করেছেন? বিজ্ঞাপন-মুক্ত কেনাকাটা পুনরুদ্ধার করতে এখানে ট্যাপ করুন।
fa: برنامه را دوباره نصب کردید یا دستگاه تغییر دادید؟ برای بازیابی خرید بدون تبلیغ اینجا بزنید.
pl: Zainstalowae aplikacj ponownie lub zmienie urzdzenie? Dotknij tutaj, aby przywróci zakup bez reklam.
sv: Ominstallerade appen eller bytte enhet? Tryck här för att återställa ditt reklamfria köp.
th: ติดตั้งแอปใหม่หรือเปลี่ยนอุปกรณ์ใช่ไหม? แตะที่นี่เพื่อกู้คืนการซื้อไม่มีโฆษณาของคุณ
tl: Nag-reinstall ng app o nagpalit ng device? I-tap dito para ibalik ang iyong walang ads na pagbili.
uk: Перевстановили застосунок або змінили пристрій? Натисніть тут, щоб відновити покупку без реклами.
ur: ุงูพ ุฏูุจุงุฑ ุงูุณูนุงู ฺฉ ุง ฺูุงุฆุณ ุจุฏูุ ุงุดุชุงุฑ ูุฑ ุฎุฑุฏุงุฑ ุจุญุงู ฺฉุฑู ฺฉ ู ุงฺบ ูนูพ ฺฉุฑฺบ
vi: Đã cài lại ứng dụng hoặc đổi thiết bị? Nhấn vào đây để khôi phục giao dịch không quảng cáo.

# purchaseFailed
source: Purchase failed. Please try again.
bn: কেনাকাটা ব্যর্থ হয়েছে। অনুগ্রহ করে আবার চেষ্টা করুন।
fa: خرید ناموفق بود. لطفاً دوباره تلاش کنید.
pl: Zakup nie powiód si. Spróbuj ponownie.
sv: Köpet misslyckades. Försök igen.
th: การซื้อล้มเหลว กรุณาลองอีกครั้ง
tl: Nabigo ang pagbili. Pakisubukan muli.
uk: Покупка не вдалася. Спробуйте ще раз.
ur: ุฎุฑุฏุงุฑ ูุงฺฉุงู  ุจุฑุง ฺฉุฑู ุฏูุจุงุฑ ฺฉูุดุด ฺฉุฑฺบ
vi: Giao dịch thất bại. Vui lòng thử lại.

# purchaseRestored
source: Purchase restored successfully!
bn: কেনাকাটা সফলভাবে পুনরুদ্ধার হয়েছে!
fa: خرید با موفقیت بازیابی شد!
pl: Zakup przywrócony pomylnie!
sv: Köpet har återställts!
th: กู้คืนการซื้อสำเร็จ!
tl: Matagumpay na naibalik ang pagbili!
uk: Покупку успішно відновлено!
ur: ุฎุฑุฏุงุฑ ฺฉุงู ุงุจ ุณ ุจุญุงู ู ฺฏุฆ!
vi: Khôi phục giao dịch thành công!

# noPurchaseToRestore
source: No purchase found to restore
bn: পুনরুদ্ধার করার জন্য কোনো কেনাকাটা পাওয়া যায়নি
fa: هیچ خریدی برای بازیابی یافت نشد
pl: Nie znaleziono zakupu do przywrócenia
sv: Inget köp att återställa
th: ไม่พบการซื้อที่จะกู้คืน
tl: Walang pagbili na maibabalik
uk: Немає покупок для відновлення
ur: ุจุญุงู ฺฉุฑู ฺฉ ู ฺฉูุฆ ุฎุฑุฏุงุฑ ูฺบ ู ู
vi: Không tìm thấy giao dịch để khôi phục

source: Buy
bn: কিনুন
fa: خرید
pl: Kup
sv: Köp
th: ซื้อ
tl: Bumili
uk: Купити
ur: ุฎุฑุฏฺบ
vi: Mua
